app/controllers/compreingressos_controller.rb

  def index
    unless session[:cidade_id]
      session[:cidade_id] = 1
    end

    if Time.now.hour == 0
      if Time.now.min < 15
        desativaentradasprogramadas
      end
    end
    if Time.now.hour == 9
      if Time.now.min < 15
        desativaentradasprogramadas
      end
    end
    #sac@compreingressos.com senha: 301226clc
    if params[:pagseguro]=='1'
      i = Intensivamedcontador.find(1)
      i.total = i.total+1
      i.save
      redirect_to('/')
    end

    cidade = Cidade.find(session[:cidade_id])

    @visores_grupo =  Visor.all(:conditions => ["data_de_expiracao >= ? AND posicao = 'esquerda' AND grupo = 'mosaico'", DateTime.now.in_time_zone('Brasilia')], :order => 'visores.order')
    @visores_esquerda = Visor.all(:conditions => ["data_de_expiracao >= ? AND posicao = 'esquerda' AND grupo = ''", DateTime.now.in_time_zone('Brasilia')], :order => 'visores.order')
    @visores_direita = Visor.all(:conditions => ["data_de_expiracao >= ? AND posicao = 'direita'", DateTime.now.in_time_zone('Brasilia')], :order => 'visores.order')
    @banner_fixos = BannerFixo.all(:order => "ordem DESC")
    @home_modulos = HomeModulo.find(:all, :conditions => ["entrada <= ? AND saida > ?", DateTime.now.in_time_zone('Brasilia'), DateTime.now.in_time_zone('Brasilia')], :order => :ordem)
---
SELECT * FROM `cidades` WHERE (`cidades`.`id` = 1)
SELECT * FROM `visores` WHERE (data_de_expiracao >= '2016-05-20 15:15:41') ORDER BY visores.order
SELECT * FROM `banner_fixos` ORDER BY ordem DESC
SELECT * FROM `home_modulos` WHERE (entrada <= '2016-05-20 15:15:41' AND saida > '2016-05-20 15:15:41') ORDER BY ordem