app/controllers/espetaculos_controller.rb

  def show

    @espetaculo = Espetaculo.find(params[:id], :include => :horarios_disponiveis)
    @title = @espetaculo.nome
    @keywords = @espetaculo.keywords
    @description = @espetaculo.description
    @pagina = flash[:pagina]
    @imagem = ENVIRONMENT_VARS['host']+@espetaculo.img_miniatura.url(:miniatura)

    # Conta visitas
    #sql = "UPDATE espetaculos SET visitas = visitas+1 WHERE id = #{@espetaculo.id};"
    #ActiveRecord::Base.connection.execute(sql)

    # Define o maximo de outros espetaculos para serem exibidos se for itaucard exibe mais se não exibe menos
    maximo_outros_espetaculos = 4
    if @espetaculo.pagina_especiais.include?(@espetaculo.pagina_especiais.find_by_id(1))
---
SELECT * FROM `espetaculos` WHERE (`espetaculos`.`id` = 6529)
SELECT * FROM `espetaculos` INNER JOIN `espetaculos_pagina_especiais` ON `espetaculos`.id = `espetaculos_pagina_especiais`.espetaculo_id WHERE (`espetaculos_pagina_especiais`.pagina_especial_id = 86 AND (espetaculos.ativo = 1 AND espetaculos.id NOT IN (6529))) ORDER BY espetaculos.relevancia DESC, RAND() LIMIT 6
SELECT `pagina_especiais`.id FROM `pagina_especiais` INNER JOIN `espetaculos_pagina_especiais` ON `pagina_especiais`.id = `espetaculos_pagina_especiais`.pagina_especial_id WHERE (`pagina_especiais`.`id` = 1) AND (`espetaculos_pagina_especiais`.espetaculo_id = 6529 ) LIMIT 1

    # Caso o usuário não tenha vindo de uma página especial
    else
      # Espetaculos no mesmo teatro
      @outros_espetaculos = Espetaculo.find(:all,
                                            :include => :proximo_horario,
                                            :conditions => ["espetaculos.teatro_id = #{@espetaculo.teatro_id.to_s} AND espetaculos.id != #{@espetaculo.id.to_s} AND espetaculos.ativo = 1"],
                                            :order => 'espetaculos.relevancia DESC, espetaculos.nome ASC',
                                            :limit => maximo_outros_espetaculos)
---
SELECT * FROM `teatros` WHERE (`teatros`.`id` = 829)
SELECT `horarios`.* FROM `horarios` WHERE (`horarios`.espetaculo_id = 6529 AND (horarios.data >= '2018-06-18 09:05:37')) ORDER BY data


      # Espetaculos na mesma cidade com o mesmo genero
      if @outros_espetaculos.size < maximo_outros_espetaculos
        e = Espetaculo.find(:all,
                            :include => :proximo_horario,
                            :joins => ["INNER JOIN teatros ON teatros.id = espetaculos.teatro_id",
                                       "INNER JOIN cidades ON cidades.id = teatros.cidade_id AND cidades.id = #{@espetaculo.teatro.cidade.id.to_s}"],
                            :conditions => ["espetaculos.genero_id = #{@espetaculo.genero_id.to_s} AND espetaculos.id != #{@espetaculo.id.to_s} AND espetaculos.ativo = 1 AND espetaculos.id NOT IN (#{oe_ids})"],
                            :order => 'espetaculos.relevancia DESC, espetaculos.nome ASC',
                            :limit => maximo_outros_espetaculos-@outros_espetaculos.size)
---
SELECT * FROM `cidades` WHERE (`cidades`.`id` = 1)
SELECT * FROM `generos` WHERE (`generos`.`id` = 2)