app/controllers/pagina_especiais_controller.rb


          # Caso não seja ordenado por data
          if (params[:ordem].blank? and @pagina_especial.organizado_por!=3) or (params[:ordem]!='data' and @pagina_especial.organizado_por!=3)
            @espetaculos = Espetaculo.find(:all,
                                           :select => 'espetaculos.*',
                                           :conditions => [cond],
                                           :joins => ["INNER JOIN teatros ON teatros.id = espetaculos.teatro_id",
                                                      "INNER JOIN cidades ON teatros.cidade_id = cidades.id AND cidades.id = #{@pecidade.id}",
                                                      "INNER JOIN espetaculos_pagina_especiais ON espetaculos.id = espetaculos_pagina_especiais.espetaculo_id AND espetaculos_pagina_especiais.pagina_especial_id = #{@pagina_especial.id}",
                                                      @innerjoin],
                                           :order => order)
---
SELECT * FROM `teatros` WHERE (`teatros`.`id` = 57)
SELECT `cidades`.* FROM `cidades` INNER JOIN `teatros` ON `cidades`.id = `teatros`.cidade_id WHERE ((`teatros`.id = 57))
SELECT `espetaculos`.* FROM `espetaculos` INNER JOIN espetaculos_pagina_especiais ON espetaculos.id = espetaculos_pagina_especiais.espetaculo_id AND espetaculos_pagina_especiais.pagina_especial_id = 50 WHERE (espetaculos.ativo = 1) ORDER BY espetaculos.relevancia DESC, espetaculos.nome ASC

            @espetaculos = []
            ids = "0"
            # Query para pegar os espetaculos que tem data e organizar por ordem de apresentacao mais proxima
            espetaculos = Espetaculo.find(:all,
                                          :select => 'espetaculos.*, min(horarios.data)',
                                          :conditions => ["#{cond} AND horarios.data >= ?", DateTime.now],
                                          :joins => ["INNER JOIN horarios ON horarios.espetaculo_id = espetaculos.id",
                                                     "INNER JOIN teatros ON teatros.id = espetaculos.teatro_id",
                                                     "INNER JOIN cidades ON teatros.cidade_id = cidades.id AND cidades.id = #{@pecidade.id}",
                                                     "INNER JOIN espetaculos_pagina_especiais ON espetaculos.id = espetaculos_pagina_especiais.espetaculo_id AND espetaculos_pagina_especiais.pagina_especial_id = #{@pagina_especial.id}",
                                                     @innerjoin],
                                          :group => "horarios.espetaculo_id",
                                          :order => order)
---
SELECT * FROM `horarios` WHERE (`horarios`.espetaculo_id = 5155 AND (horarios.data >= '2016-05-20 12:15:47')) ORDER BY data LIMIT 1


          # Caso não seja ordenado por data
          if (params[:ordem].blank? and @pagina_especial.organizado_por!=3) or (params[:ordem]!='data' and @pagina_especial.organizado_por!=3)
            @espetaculos = Espetaculo.find(:all,
                                           :conditions => ["#{cond} AND espetaculos.genero_id = ?", @pegenero.id],
                                           :joins => ["INNER JOIN espetaculos_pagina_especiais ON espetaculos.id = espetaculos_pagina_especiais.espetaculo_id AND espetaculos_pagina_especiais.pagina_especial_id = #{@pagina_especial.id}",
                                                      @innerjoin],
                                           :order => order)
---
SELECT * FROM `generos` WHERE (`generos`.`id` = 5)


      if !params[:busca].blank?
        busca = params[:busca].first(50) if params[:busca]!='Nome da peça, teatro, local, elenco...'
        @espetaculos = Espetaculo.search busca,
        :field_weights => {:nome => 100, :genero =>80, :teatro_nome => 80, :cidade => 70, :estado => 70, :keywords => 70, :endereco => 50, :bairro => 50, :entradas => 30},
        :match_mode => :any,
        :sort_mode => :extended,
        :joins => ["INNER JOIN espetaculos_pagina_especiais ON espetaculos.id = espetaculos_pagina_especiais.espetaculo_id AND espetaculos_pagina_especiais.pagina_especial_id = #{@pagina_especial.id}",
                   @innerjoin],
        :order => "@relevance DESC",
        :index => "privado",
        :per_page => 1000
---
SELECT count(1) as total, generos.nome FROM `generos` INNER JOIN espetaculos ON espetaculos.genero_id = generos.id INNER JOIN espetaculos_pagina_especiais ON espetaculos_pagina_especiais.espetaculo_id = espetaculos.id AND espetaculos_pagina_especiais.pagina_especial_id = 50 WHERE (espetaculos.ativo = true) GROUP BY generos.id ORDER BY total DESC