app/controllers/textos_controller.rb

  def show
    @texto = Texto.find(params[:id])
---
SELECT * FROM `textos` WHERE (`textos`.`id` = 2)